lemariva/tiva_tm4c1294_ov7670_security_camera/enet_io.c
        }
    }
}

//*****************************************************************************
//
// Configure board to use the ov7670
//
//*****************************************************************************
void ConfigureBoard(void)
{
    // Enable and configure the GPIO port
    //ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA | SYSCTL_PERIPH_GPIOB | SYSCTL_PERIPH_GPIOC | SYSCTL_PERIPH_GPIOD | SYSCTL_PERIPH_GPIOE | SYSCTL_PERIPH_GPIOF);
	//ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
	ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
	ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
	ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOK);
	ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
	ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOM);
	ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOP);

	//ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C1);
    // PORT A
    ROM_GPIOPinTypeGPIOOutput(RRST_PORT, RRST);
    ROM_GPIOPinWrite(RRST_PORT, RRST, 0x00);
    GPIOPadConfigSet(RRST_PORT,  RRST, GPIO_STRENGTH_12MA, GPIO_PIN_TYPE_STD);

    // PORT P
    ROM_GPIOPinTypeGPIOInput(VSYNC_PORT, VSYNC);
    GPIOPadConfigSet(VSYNC_PORT,  VSYNC, GPIO_STRENGTH_12MA, GPIO_PIN_TYPE_STD);

    ROM_GPIOPinTypeGPIOOutput(RCLK_PORT, RCLK);
    ROM_GPIOPinWrite(RCLK_PORT, RCLK, 0x00);
    GPIOPadConfigSet(RCLK_PORT,  RCLK, GPIO_STRENGTH_12MA, GPIO_PIN_TYPE_STD);

    // PORT M
    ROM_GPIOPinTypeGPIOOutput(WEN_PORT, WEN);
    ROM_GPIOPinWrite(WEN_PORT, WEN, 0x00);
    GPIOPadConfigSet(WEN_PORT, WEN, GPIO_STRENGTH_12MA , GPIO_PIN_TYPE_STD);

    // PORT K
    ROM_GPIOPinTypeGPIOInput(DATA_PORT, GPIO_DATA);
    GPIOPadConfigSet(DATA_PORT, GPIO_DATA, GPIO_STRENGTH_12MA , GPIO_PIN_TYPE_STD);

    // PORT N
    //GPIOPinTypeGPIOOutput(LEDS_PORT, RED_LED|GREEN_LED);
    //GPIOPinWrite(LEDS_PORT, RED_LED|GREEN_LED, 0x00);
    //GPIOPadConfigSet(LEDS_PORT,  RED_LED|GREEN_LED, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD);
}

//*****************************************************************************
//
// Configure the UART and its pins for ov7670
//
//*****************************************************************************
void
ConfigureUART(void)
{
    //
    // Enable UART6
    //
	ROM_SysCtlPeripheralEnable(PERIPH_UART);

    //
    // Configure GPIO Pins for UART mode.
    //
    ROM_GPIOPinConfigure(GPIO_UARTRX);
    ROM_GPIOPinConfigure(GPIO_UARTTX);
    ROM_GPIOPinTypeUART(PORT_UART,  TXD | RXD);

    //
    // Use oscillator as the UART clock source.
    //
    ROM_UARTConfigSetExpClk		(UART_UNIT, g_ui32SysClock, 115200,	//115200 internal 16mHz oscilator -> UART_CLOCK_PIOSC (UARTClockSourceSet(UART_UNIT, UART_CLOCK_PIOSC))
                            (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
                             UART_CONFIG_PAR_NONE));
    //
    // Initialize the UART interruption
    //
    // Set both the TX and RX trigger thresholds to 4.  This will be used by
	// the uDMA controller to signal when more data should be transferred.  The
	// uDMA TX and RX channels will be configured so that it can transfer 2
	// bytes in a burst when the UART is ready to transfer more data.
	//
    ROM_UARTFIFOLevelSet(UART_UNIT, UART_FIFO_TX1_8, UART_FIFO_RX1_8);

    UARTIntRegister(UART_UNIT, UARTIntHandler);

    ROM_IntEnable(UART_INT);
    ROM_UARTIntEnable(UART_UNIT, UART_INT_RX | UART_INT_RT);

}

//*****************************************************************************
//
// Configure the I2C and its pins for ov7670
//
//*****************************************************************************
void
ConfigureI2C(void)
{
	//
	// Enable I2C2
	//
	//
	ROM_SysCtlPeripheralEnable(PERIPH_I2C);
	ROM_SysCtlPeripheralEnable(PORT_I2C);

    //
    // Configure GPIO Pins for I2C mode.
    //
	ROM_GPIOPinTypeI2CSCL(PORT_I2C, SCK);
	ROM_GPIOPinTypeI2C(PORT_I2C, SDA);
	//GPIOPadConfigSet(PORT_I2C, SCK | SDA, GPIO_STRENGTH_12MA , GPIO_PIN_TYPE_STD);

	ROM_GPIOPinConfigure(GPIO_I2CSCL);
	ROM_GPIOPinConfigure(GPIO_I2CSDA);

	// Use oscillator as the I2C clock source.
	//
	ROM_I2CMasterInitExpClk(I2C_UNIT, g_ui32SysClock, false);  //false = 100 Khz, true = 400KHz m_I2CBus

	ROM_SysCtlDelay(10000);
	ROM_I2CMasterEnable(I2C_UNIT);
}

//*****************************************************************************
//
// This example demonstrates the use of the Ethernet Controller and lwIP
// TCP/IP stack to control various peripherals on the board via a web
// browser.
//
//*****************************************************************************
int
main(void)
{
    uint32_t ui32User0, ui32User1;
    uint8_t pui8MACArray[8];
    uint8_t i = 0; // camera initialization
    //
    // Make sure the main oscillator is enabled because this is required by
    // the PHY.  The system must have a 25MHz crystal attached to the OSC
    // pins.  The SYSCTL_MOSC_HIGHFREQ parameter is used when the crystal
    // frequency is 10MHz or higher.
    //
    SysCtlMOSCConfigSet(SYSCTL_MOSC_HIGHFREQ);

    //
    // Run from the PLL at 120 MHz.
    //
    g_ui32SysClock = MAP_SysCtlClockFreqSet((SYSCTL_XTAL_25MHZ |
                                             SYSCTL_OSC_MAIN |
                                             SYSCTL_USE_PLL |
                                             SYSCTL_CFG_VCO_480), 120000000);

    //
    // Configure the device pins.
    //
    PinoutSet(true, false);

    //
    // Configure debug port for internal use.
    //
    UARTStdioConfig(0, 115200, g_ui32SysClock);

    //
    // Clear the terminal and print a banner.
    //
    UARTprintf("\033[2J\033[H");
    UARTprintf("Ethernet IO Example\n\n");

    //
    // Configure SysTick for a periodic interrupt.
    //
    MAP_SysTickPeriodSet(g_ui32SysClock / SYSTICKHZ);
    MAP_SysTickEnable();
    MAP_SysTickIntEnable();

    //
    // Configure the hardware MAC address for Ethernet Controller filtering of
    // incoming packets.  The MAC address will be stored in the non-volatile
    // USER0 and USER1 registers.
    //
    MAP_FlashUserGet(&ui32User0, &ui32User1);
    if((ui32User0 == 0xffffffff) || (ui32User1 == 0xffffffff))
    {
        //
        // Let the user know there is no MAC address
        //
        UARTprintf("No MAC programmed!\n");

        while(1)
        {
        }
    }

    //
    // Tell the user what we are doing just now.
    //
    UARTprintf("Waiting for IP.\n");

    //
    // Convert the 24/24 split MAC address from NV ram into a 32/16 split
    // MAC address needed to program the hardware registers, then program
    // the MAC address into the Ethernet Controller registers.
    //
    pui8MACArray[0] = ((ui32User0 >>  0) & 0xff);
    pui8MACArray[1] = ((ui32User0 >>  8) & 0xff);
    pui8MACArray[2] = ((ui32User0 >> 16) & 0xff);
    pui8MACArray[3] = ((ui32User1 >>  0) & 0xff);
    pui8MACArray[4] = ((ui32User1 >>  8) & 0xff);
    pui8MACArray[5] = ((ui32User1 >> 16) & 0xff);

    //
    // Initialze the lwIP library, using DHCP.
    //
    lwIPInit(g_ui32SysClock, pui8MACArray, 0, 0, 0, IPADDR_USE_DHCP);

    //
    // Setup the device locator service.
    //
    LocatorInit();
    LocatorMACAddrSet(pui8MACArray);
    LocatorAppTitleSet("EK-TM4C1294XL enet_io");

    //
    // Initialize a sample httpd server.
    //
    httpd_init();

    //
    // Set the interrupt priorities.  We set the SysTick interrupt to a higher
    // priority than the Ethernet interrupt to ensure that the file system
    // tick is processed if SysTick occurs while the Ethernet handler is being
    // processed.  This is very likely since all the TCP/IP and HTTP work is
    // done in the context of the Ethernet interrupt.
    //
    MAP_IntPrioritySet(INT_EMAC0, ETHERNET_INT_PRIORITY);
    MAP_IntPrioritySet(FAULT_SYSTICK, SYSTICK_INT_PRIORITY);

    //
    // Pass our tag information to the HTTP server.
    //
    http_set_ssi_handler((tSSIHandler)SSIHandler, g_pcConfigSSITags,
            NUM_CONFIG_SSI_TAGS);

    //
    // Pass our CGI handlers to the HTTP server.
    //
    http_set_cgi_handlers(g_psConfigCGIURIs, NUM_CONFIG_CGI_URIS);

    //
    // Initialize IO controls
    //
    io_init();



   //
   // Port/Pin configuration for ov7670 camera
   //
   ConfigureBoard();

   // UART configuration for ov7670 camera
   ConfigureUART();

