lemariva/tiva_tm4c1294_ov7670_security_camera/enet_io.c
   // ******************************************
   // Welcome message
   tprintf("Hello world!\r\n");

   wait(delay_120ns);
   tprintf("Initializing i2c...");

   // I2C configuration
   ConfigureI2C();

   wait(delay_120ns);
   tprintf("done.\r\n");

   tprintf("Initializing ov7670...\r\n");
   for (i = 0; i < 10; i ++) {
	   if (ov7670_init()) {
		   break;
	   } else if (i == 5) {
		   tprintf("\r\nPANIC! ov7670 init keeps failing!\r\n");
		   while (1);
	   } else {
		   tprintf("retrying...\r\n");
		   wait(delay_120ns);
	   }
   }
   wait(delay_120ns);
   tprintf("done.\r\n");

   tprintf("READY\r\n");
    //
    // Loop forever, processing the on-screen animation.  All other work is
    // done in the interrupt handlers.
    //
    while(1)
    {
        //
        // Wait for a new tick to occur.
        //
        while(!g_ulFlags)
        {
            //
            // Do nothing.
            //
        }

        //
        // Clear the flag now that we have seen it.
        //
        HWREGBITW(&g_ulFlags, FLAG_TICK) = 0;

        //
        // Toggle the GPIO
        //
        MAP_GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1,
                (MAP_GPIOPinRead(GPIO_PORTN_BASE, GPIO_PIN_1) ^
                 GPIO_PIN_1));
    }
}


//*****************************************************************************
//
// The UART interrupt handler.
//
//*****************************************************************************
void
UARTIntHandler(void)
{
	uint32_t ui32Status;
	uint8_t arrayptr;
	uint8_t tmp_char;
	uint16_t j = 0;
	// Get the interrupt status.
	ui32Status = ROM_UARTIntStatus(UART_UNIT, true);
	// Clear the asserted interrupts.
	ROM_UARTIntClear(UART_UNIT, ui32Status);

	arrayptr = 0;
	tmp_char = 0;
	// Loop while there are characters in the receive FIFO.
	while(ROM_UARTCharsAvail(UART_UNIT) && tmp_char != '\r')
	{
		// Read the next character from the UART and write it back to the UART.
		//UARTCharPutNonBlocking(UART_UNIT, UARTCharGetNonBlocking(UART_UNIT));
		tmp_char = ROM_UARTCharGetNonBlocking(UART_UNIT);
		if ((tmp_char >= 32) && (tmp_char <= 126)) {
			rcvbuf[arrayptr++] = tmp_char;
		} else if (tmp_char == 13) {
			// Turn on the LED
			led_status ^= 1;
			//if(led_status==1)
				//GPIOPinWrite(LEDS_PORT, RED_LED, RED_LED);
			//else
				//GPIOPinWrite(LEDS_PORT, RED_LED, ~RED_LED);
			hasReceived = 1;
			break;
		}
		ROM_SysCtlDelay(8000);
	}

	if(hasReceived==1)
	{
			hasReceived = 0;
			if (strcmp((char *) rcvbuf, "hello") == 0) {
				tprintf("Hello to you too!\r\n");
			} else if (strncmp((char *) rcvbuf, "cap", 3) == 0) {
				ov7670_capture();
				tprintf("OK\r\n");
			} else if (strncmp((char *) rcvbuf, "rrst", 4) == 0) {
				ov7670_rrst();
				tprintf("OK\r\n");
			} else if (strncmp((char *) rcvbuf, "init", 4) == 0) {
				ov7670_init();
				tprintf("OK\r\n");
			} else if (strncmp((char *) rcvbuf, "img", 3) == 0) {
				ov7670_image_uart();
			} else if (strlen((char *) rcvbuf) > 5 &&
					strncmp((char *) rcvbuf, "read ", 5) == 0) {
				for (j = 0; j < atoi((char *) (rcvbuf + 5)); j++) {
					ROM_UARTCharPut(UART_UNIT, ov7670_read());
				}
			} else if (strlen((char *) rcvbuf) > 6 &&
					strncmp((char *) rcvbuf, "hread ", 6) == 0) {
				for (j = 0; j < atoi((char *) (rcvbuf + 6)); j++) {
					tprintf("Data: [0x%x] j: %i\r\n", ov7670_read(), j);
				}
			}
	}
	//IntEnable(UART1_BASE);
}
